Reports/TryingTest/New Test/20190403_204433/requests/main/2.har

{
  "log" : {
    "version" : "1.2",
    "creator" : {
      "name" : "BrowserMob Proxy",
      "version" : "2.1.5",
      "comment" : ""
    },
    "pages" : [ {
      "id" : "Page 0",
      "startedDateTime" : "2019-04-03T14:44:59.067Z",
      "title" : "Page 0",
      "pageTimings" : {
        "onLoad" : 459,
        "comment" : ""
      },
      "comment" : ""
    } ],
    "entries" : [ {
      "pageref" : "Page 0",
      "startedDateTime" : "2019-04-03T14:44:59.070Z",
      "request" : {
        "method" : "POST",
        "url" : "http://www.thomas-bayer.com/axis2/services/BLZService",
        "httpVersion" : "HTTP/1.1",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        }, {
          "name" : "SOAPAction",
          "value" : ""
        }, {
          "name" : "User-Agent",
          "value" : "Java/1.8.0_181"
        }, {
          "name" : "Host",
          "value" : "www.thomas-bayer.com"
        }, {
          "name" : "Accept",
          "value" : "text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2"
        }, {
          "name" : "Proxy-Connection",
          "value" : "keep-alive"
        }, {
          "name" : "Content-Length",
          "value" : "265"
        } ],
        "queryString" : [ ],
        "postData" : {
          "mimeType" : "text/xml; charset=utf-8",
          "text" : "<?xml version=\"1.0\" encoding=\"UTF-8\"?><SOAP-ENV:Envelope xmlns:<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <getBank xmlns=\"http://thomas-bayer.com/blz/\">\n            <blz>50230000</blz>\n        </getBank>\n    </Body>\n</Envelope>\n",
          "comment" : ""
        },
        "headersSize" : 295,
        "bodySize" : 265,
        "comment" : ""
      },
      "response" : {
        "status" : 500,
        "statusText" : "Internal Server Error",
        "httpVersion" : "HTTP/1.1",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Server",
          "value" : "Apache-Coyote/1.1"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml;charset=utf-8"
        }, {
          "name" : "Date",
          "value" : "Wed, 03 Apr 2019 14:45:30 GMT"
        }, {
          "name" : "Connection",
          "value" : "close"
        }, {
          "name" : "Content-Length",
          "value" : "4272"
        } ],
        "content" : {
          "size" : 4272,
          "mimeType" : "text/xml;charset=utf-8",
          "text" : "<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\"><soapenv:Header><wsa:Action>http://www.w3.org/2005/08/addressing/soap/fault</wsa:Action></soapenv:Header><soapenv:Body><soapenv:Fault><faultcode></faultcode><faultstring>com.ctc.wstx.exc.WstxUnexpectedCharException: Unexpected character '&lt;' (code 60) (expected a name start character)\n at [row,col {unknown-source}]: [1,64]</faultstring><detail><Exception>org.apache.axis2.AxisFault: com.ctc.wstx.exc.WstxUnexpectedCharException: Unexpected character '&lt;' (code 60) (expected a name start character)\n at [row,col {unknown-source}]: [1,64]\n\tat org.apache.axis2.AxisFault.makeFault(AxisFault.java:417)\n\tat org.apache.axis2.transport.http.HTTPTransportUtils.processHTTPPostRequest(HTTPTransportUtils.java:283)\n\tat org.apache.axis2.transport.http.AxisServlet.doPost(AxisServlet.java:120)\n\tat javax.servlet.http.HttpServlet.service(HttpServlet.java:646)\n\tat javax.servlet.http.HttpServlet.service(HttpServlet.java:727)\n\tat org.apache.catalina.core.ApplicationFilterChain.internalDoFilter(ApplicationFilterChain.java:303)\n\tat org.apache.catalina.core.ApplicationFilterChain.doFilter(ApplicationFilterChain.java:208)\n\tat org.apache.catalina.core.StandardWrapperValve.invoke(StandardWrapperValve.java:220)\n\tat org.apache.catalina.core.StandardContextValve.invoke(StandardContextValve.java:122)\n\tat org.apache.catalina.authenticator.AuthenticatorBase.invoke(AuthenticatorBase.java:493)\n\tat org.apache.catalina.valves.AccessLogValve.invoke(AccessLogValve.java:950)\n\tat org.apache.catalina.core.StandardHostValve.invoke(StandardHostValve.java:170)\n\tat org.apache.catalina.valves.ErrorReportValve.invoke(ErrorReportValve.java:98)\n\tat org.apache.catalina.core.StandardEngineValve.invoke(StandardEngineValve.java:116)\n\tat org.apache.catalina.valves.RemoteIpValve.invoke(RemoteIpValve.java:683)\n\tat org.apache.catalina.connector.CoyoteAdapter.service(CoyoteAdapter.java:408)\n\tat org.apache.coyote.http11.AbstractHttp11Processor.process(AbstractHttp11Processor.java:1041)\n\tat org.apache.coyote.AbstractProtocol$AbstractConnectionHandler.process(AbstractProtocol.java:607)\n\tat org.apache.tomcat.util.net.JIoEndpoint$SocketProcessor.run(JIoEndpoint.java:315)\n\tat java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1152)\n\tat java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:622)\n\tat java.lang.Thread.run(Thread.java:748)\nCaused by: org.apache.axiom.om.OMException: com.ctc.wstx.exc.WstxUnexpectedCharException: Unexpected character '&lt;' (code 60) (expected a name start character)\n at [row,col {unknown-source}]: [1,64]\n\tat org.apache.axiom.om.impl.builder.StAXOMBuilder.next(StAXOMBuilder.java:239)\n\tat org.apache.axiom.soap.impl.builder.StAXSOAPModelBuilder.getSOAPEnvelope(StAXSOAPModelBuilder.java:161)\n\tat org.apache.axiom.soap.impl.builder.StAXSOAPModelBuilder.&lt;init>(StAXSOAPModelBuilder.java:110)\n\tat org.apache.axis2.builder.SOAPBuilder.processDocument(SOAPBuilder.java:53)\n\tat org.apache.axis2.transport.TransportUtils.createDocumentElement(TransportUtils.java:160)\n\tat org.apache.axis2.transport.TransportUtils.createSOAPMessage(TransportUtils.java:111)\n\tat org.apache.axis2.transport.http.HTTPTransportUtils.processHTTPPostRequest(HTTPTransportUtils.java:270)\n\t... 20 more\nCaused by: com.ctc.wstx.exc.WstxUnexpectedCharException: Unexpected character '&lt;' (code 60) (expected a name start character)\n at [row,col {unknown-source}]: [1,64]\n\tat com.ctc.wstx.sr.StreamScanner.throwUnexpectedChar(StreamScanner.java:623)\n\tat com.ctc.wstx.sr.StreamScanner.parseLocalName(StreamScanner.java:1712)\n\tat com.ctc.wstx.sr.BasicStreamReader.handleNsAttrs(BasicStreamReader.java:2986)\n\tat com.ctc.wstx.sr.BasicStreamReader.handleStartElem(BasicStreamReader.java:2934)\n\tat com.ctc.wstx.sr.BasicStreamReader.handleRootElem(BasicStreamReader.java:2093)\n\tat com.ctc.wstx.sr.BasicStreamReader.nextFromProlog(BasicStreamReader.java:2073)\n\tat com.ctc.wstx.sr.BasicStreamReader.next(BasicStreamReader.java:1069)\n\tat org.apache.axiom.om.impl.builder.StAXOMBuilder.next(StAXOMBuilder.java:153)\n\t... 26 more\n</Exception></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 183,
        "bodySize" : 4272,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "receive" : 5,
        "connect" : 221,
        "wait" : 224,
        "blocked" : 0,
        "send" : 1,
        "dns" : 0,
        "ssl" : -1
      },
      "serverIPAddress" : "80.152.243.114",
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "2",
        "testObjectId" : "Object Repository/SOAP/getBank",
        "harId" : "9529ddb9-0a8d-4876-8aa4-df0300ecec82"
      },
      "time" : 452
    } ],
    "comment" : ""
  }
}